import React from 'react';
import styles from "./styles.module.scss";
import Content from "../../components/Content";
import {MAIN_URL} from "../../constants";


function Block1Page() {

    return <Content next={MAIN_URL.BLOCK_2}>
        <h1>Мега история</h1>
        <h2> Блок №1 </h2>
        <br/>
        <p><b>Я точно знаю 2 вещи:</b></p>
        <ol className={styles.bullet}>
            <li>Ты хочешь быстро выучить исторические даты и события и сдать все экзамены.</li>
            <li>Я знаю, как могу тебе в этом помочь!</li>
        </ol>

        <p>Забудь про бесконечные вечера повторений и зазубриваний.
            Дай мне 12 минут, и ты сможешь учить всё в сто раз быстрее.
        <br/>
        Чтобы в процессе изучения ты понимал, почему мы будем делать всё именно так, я сразу отвечу на пару вопросов.
        </p>

        <div className={styles.author}/>
        <h3>Почему людям тяжело запоминать даты?</h3>

        <p>
            Мозг работает на ассоциациях.
            Ты легко связываешь образы, например, человека и его обычную одежду.
            Но какой образ у чисел? Его просто нет, поэтому и связать набор цифр с чем-то очень тяжело.
            Числа совершенно неосязаемы - это просто символы.
            Так что будем работать с образами!
            Чем ярче и абсурднее ассоциации между объектами, тем больше вероятность их запомнить.
        </p>

        <div className={styles.author}/>
        <h3>Как всё это поможет мне?</h3>

        <p>
            Терпение, только терпение!
            Мозг хочет оставить всё “как есть”, поэтому происходящее может казаться тебе полным бредом.
            Просто доверься учёным и тысячам людей, которые успешно используют необычные схемы запоминания.
            Уверен, ты скоро забудешь, что когда-то тебе приходилось сидеть и зубрить материал целыми днями.
        </p>
        <br/>

        <p>
            <b>
                Мы разбили всю информацию на 4 блока:
            </b>
        </p>

        <ol className={styles.bullet}>
            <li><b>Знакомство.</b> <br/>
            Этот блок уже подходит к концу.</li>
            <li><b>Система запоминания.</b> <br/>
            Тут ты быстро узнаешь о том, как учить без заучивания и сразу же увидишь результат</li>
            <li><b>Отработка навыка.</b><br/>
            Небольшая тренировка, чтобы довести изученный материал до автоматизма</li>
            <li><b>Даты.</b> <br/>
            Полный список, который ты сможешь запомнить максимально быстро.</li>
        </ol>

        <p>
            <b>
                Успех, первый блок изучен! Скорее переходи дальше.
            </b>
        </p>

    </Content>
}

export default Block1Page;
